app/Controllers/Transaksi.php

SELECT *
FROM `transaksi`
---
    public function index()
    {
        $model = new TransaksiModel();
        $data = $model->findAll();

INSERT INTO `transaksi` (`nama`, `no_tlp`, `alamat`, `metode_pembayaran`) VALUES ('ZULFA AULIA', '08267283189', 'hbghghhbh', 'cash')
---
    public function create()
    {
        $model = new TransaksiModel();

        // Validate input
        $validation = \Config\Services::validation();
        $rules = [
            'nama' => 'required',
            'no_tlp' => 'required',
            'alamat' => 'required',
            'metode_pembayaran' => 'required',
        ];

        if (!$this->validate($rules)) {
            return $this->fail($validation->getErrors());
        }

        $data = [
            'nama' => $this->request->getVar('nama'),
            'no_tlp' => $this->request->getVar('no_tlp'),
            'alamat' => $this->request->getVar('alamat'),
            'metode_pembayaran' => $this->request->getVar('metode_pembayaran'),
            // Add other fields as needed
        ];

        $model->save($data);