app/Controllers/User.php

SELECT *
FROM `user`
---
    public function index()
    {
        $model = new UserModel();
        $data = $model->findAll();

INSERT INTO `user` (`riwayat`, `tanggal`) VALUES ('pembelian', '2023-12-17')
---
    public function create()
    {
        helper(['form']);
        $rules = [
            'riwayat' => 'required',
            'tanggal' => 'required'
        ];
        $data = [
            'riwayat' => $this->request->getVar('riwayat'),
            'tanggal' => $this->request->getVar('tanggal'),
        ];
        if (!$this->validate($rules))
            return
                $this->fail($this->validator->getErrors());
        $model = new UserModel();
        $model->save($data);

UPDATE `user` SET `riwayat` = 'Mazaaya ', `tanggal` = '2023-10-19'
WHERE `user`.`id_user` IN ('5')
---
    public function update($id = null)
    {
        helper(['form']);
        $rules = [
            'riwayat' => 'required',
            'tanggal' => 'required'
        ];
        $data = [
            'riwayat' => $this->request->getVar('riwayat'),
            'tanggal' => $this->request->getVar('tanggal'),
        ];
        if (!$this->validate($rules))
            return
                $this->fail($this->validator->getErrors());
        $model = new UserModel();
        $findById = $model->find(['id' => $id]);
        if (!$findById)
            return $this->FailNotFound('No Data Found');
        $model->update($id, $data);